ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
/******************************************************************************
*
* Copyright 2006-2015 Freescale Semiconductor, Inc.
* Copyright 2016-2018 NXP
* 
* Revision 1.5
* AMMCLib v1.1.12 and higher
*
***************************************************************************/

#include "mc9s12zvml128.h"
#include "S12zvm_periph.h"
#include "freemaster.h"
#include "state_machine.h"
#include "mlib.h"
#include "gflib.h"
#include "gmclib.h"
#include "gdflib.h"
#include "motor_structure.h"
#include "S12ZVM_devconfig.h"
#include "meas_s12zvm.h"
#include "actuate_s12zvm.h"
#include "eeprom_S12Z.h"
#include "pwm_control.h"

#include "BSW.h"

// static configuration generated by MCAT
#include "PMSM_appconfig.h"
#include "motorinter.h"
//#include "lini.h"

#include <hidef.h> /* for EnableInterrupts macro */
#include "derivative.h" /* include peripheral declarations */
//#if _TL_FRAME_SUPPORT_==_TL_MULTI_FRAME
//#include "lin_lin21tl_api.h"
#include "lin.h"




/*****************************************************************************
*
* Definitions
*
*****************************************************************************/

/*****************************************************************************
*
* Variables Definition
*
*****************************************************************************/
pmsmDrive_t         drvFOC;         // Field Oriented Control Variables
driveStates_t 		cntrState;	    // Responsible for stateMachine state propagation
appFaultStatus_t	tempfaults;		// Temporary faults to be indicated inhere
appFaultStatus_t	permFaults;		// Permanent faults to be indicated inhere
fm_scale_t			fmScale;		// Scales for freemaster interface
measModule_t		meas;
tPos_mode			pos_mode;

static tBool focFastLoop(void);
static tBool focSlowLoop(void);
static tBool faultDetection();

// Interrupts
INTERRUPT void TIMchan0_ISR();
INTERRUPT void TIMchan3_ISR();
INTERRUPT void PTUTrigger0Done_ISR(void);
INTERRUPT void PTUTrigger1Done_ISR(void);
INTERRUPT void ADC0error_ISR(void);
INTERRUPT void ADC1error_ISR(void);
INTERRUPT void ADC0done_ISR(void);
INTERRUPT void ADC1done_ISR(void);
INTERRUPT void PMFreloadA_ISR(void);






// Debug variables
static tFrac16			reload_PmfCnt;
volatile unsigned int 	AdcErrorLDOK, AdcErrorRSTAR, AdcErrorTRIG, AdcErrorEOL, AdcErrorCMD, AdcErrorIA;
volatile unsigned int 	AdcError0, AdcError1, TrigError0, TrigError1;
volatile tBool useRawDCBusForElim = true;
// End of debug variables

// Open Loop and Closed loop speed ramp variants
volatile tFrac32    OL_SpeedRampInc = 0, CL_SpeedRampInc = 0, CL_SpeedRampDec = 0;

pwmControl_t pwmControlData;			//PWM input control data structure
static tBool pwmControlEnabled = false;	// Off by default

GDFLIB_FILTER_MA_T_F16 	f16pwmInputMA = GDFLIB_FILTER_MA_DEFAULT_F16;

/*************************************************************/
l_u16 Ref_speed;
unsigned int App_count=0,App_temp=0;
unsigned int dutytt=6;

#include "Common_LIB.h"
#include "Common.h"
#include "SystemSchedule.h"
unsigned char uc1msflag = 0;
void systick_1ms(void);
void systick_1ms(void)
{
	uc1msflag = FLAG_SET;
	
	SetFlag_1MS();
}


/*****************************************************************************
*
* Function: void main(void)
*
* Description: main function
*
*****************************************************************************/
void main(void)
{
	cpmu_init();
	pim_init();
	pmf_init();
	ptu_init();
	adc0_init();
	adc1_init();
	//sci0_init();
	sci1_init();
	gdu_init();
	EEPROM_Init(0x31);
	initTIM();
	initLIN();
	l_sys_init();
	l_ifc_init(LIN_NXP);
	
	//FMSTR_Init();
	
	// Init state set and e_reset event is thrown to call the reset state
	cntrState.state   	= init;
	cntrState.event 	= e_reset;
	
	EnableInterrupts;
	
	// Initial call of the finite state machine 
	state_table[cntrState.event][cntrState.state]();
	
	//Default setting of a FOC Control Mode
	cntrState.usrControl.FOCcontrolMode		= speedControl;
	
	EnableInterrupts;
	
	SystemSchedule_Init();
	TIM0TSCR2_TOI	= 1;
	
	DDRP_DDRP1 = 0;	
	PPSP_PPSP1 = 0;           // 0/1 = pull up/down = falling/rising edge selected
//	PERP_PERP1 = 1;
	PIEP_PIEP1 = 1;           // interrupt is enabled
	
	 //tFrac16
//	BSW_PWM_Init();
//	LP0CR_LPE     = 0; 
//	  SCI0CR2_TE = 0;
//	  SCI0CR2_RE = 0;
//	  SCI1CR2_TE = 0;
//	  SCI1CR2_RE = 0;
	
//	// eeprom write read test.
//	//-------------------------------------------
//	unsigned char tempreadarr[16] = {0};
//	unsigned char tempwritearr[16] = {0};
//	unsigned char i = 0, j = 0;
//	for(i=0; i < 32;i++)
//	{
//		for(j=0;j<16;j++)
//		{
//			tempwritearr[j]=i;
//		}
//		flashoperation_1(tempwritearr, i, 16);		
//	}
//	//-------------------------------------------

//	//PMFCFG2_MSK  = 0x0;
//	//Set_Bridge_DutyCycle(2,0,0); 
//	
//	//DisableOutput();
//    //Meas_CalibCurrentSense(&meas, drvFOC.svmSector);
//	
//	while(1)
//	{
//		__RESET_WATCHDOG();
//		//meas.offset.f16Idcb.f16Offset=-8244;//24800;
//		if(App_count!=App_temp)
//		{
//		 App_count=App_temp;
//		 Set_Bridge_DutyCycle(dutytt,0,0); 
//		}		
//			
//	}
	
	// Loop
	for(;;)
	{
		SystemSchedule_Main();
//		if(App_count>40000)
//		BSW_setpinstatus_interface(1);
//		else
//		BSW_setpinstatus_interface(0);	
		// FreeMASTER poll function call
		//FMSTR_Poll();
		__RESET_WATCHDOG();
//       if(l_flg_tst_LIN_NXP_MotorCtrl_flag())   //
//       {
//    	   l_flg_clr_LIN_NXP_MotorCtrl_flag(); 
//    	   Ref_speed=l_u16_rd_LIN_NXP_RefSpeed();
//    	   MotorDrive_Regulation(Ref_speed*300,0);
//       }
//
//	   if(App_count>10000)
//	   {
//		   App_count=5000;//*(Meas_GetTemp_NTC(&meas));		     
//	       //l_u8_wr_LIN_NXP_NTC((l_u8)(MotorDrive_uiTemperatureNTC>>4));//refresh NTC Temperature
//	   }
		
	   			  
	}
}


/*****************************************************************************
*
* Function: void ADC0error_ISR(void)
*
* Description: ADC0 Error Interrupt Service Routine to track errors
*
*****************************************************************************/
INTERRUPT void ADC0error_ISR(void)
{
	char tmpAdcEIF;

	EnableInterrupts;

