ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
	AdcError0++;				// Increment the AdcError0 counter
	permFaults.mcu.B.ADC_Error = 1;	// Throw the ADC error
	tmpAdcEIF = ADC0EIF;		// read the error register

	if (tmpAdcEIF & 0x02)       // Load Ok Error 
	{
		AdcErrorLDOK++;
		ADC0EIF = 0x02;
	}
	if (tmpAdcEIF & 0x04)       // Restart Request Error
	{
		AdcErrorRSTAR++;
		ADC0EIF = 0x04;
	}
	if (tmpAdcEIF & 0x08)       // Trigger Error => Soft Reset
	{
		AdcErrorTRIG++;
		ADC0CTL_0_ADC_SR = 1;
	}
	if (tmpAdcEIF & 0x20)       // End Of List Error => Soft Reset 
	{
		AdcErrorEOL++;
		ADC0CTL_0_ADC_SR = 1;
	}
	if (tmpAdcEIF & 0x40)       // Command Value Error => Soft Reset
	{
		AdcErrorCMD++;
		ADC0CTL_0_ADC_SR = 1;
	}
	if (tmpAdcEIF & 0x80)       // Illegal Access Error => Soft Reset
	{
		AdcErrorIA++;
		ADC0CTL_0_ADC_SR = 1;
	}
	return;
}

/*****************************************************************************
*
* Function: void ADC1error_ISR(void)
*
* Description: ADC1 Error Interrupt Service Routine
*
*****************************************************************************/
INTERRUPT void ADC1error_ISR(void)
{
	char tmpAdcEIF;
	
	EnableInterrupts;
	AdcError1++;				// Increment the AdcError0 counter
	permFaults.mcu.B.ADC_Error = 1;	// Throw the ADC error
	tmpAdcEIF = ADC1EIF;		// read the error register

	if (tmpAdcEIF & 0x02)       // Load Ok Error
	{
		AdcErrorLDOK++;
		ADC1EIF = 0x02;
	}
	if (tmpAdcEIF & 0x04)       // Restart Request Error
	{
		AdcErrorRSTAR++;
		ADC1EIF = 0x04;
	}
	if (tmpAdcEIF & 0x08)       // Trigger Error => Soft Reset
	{
		AdcErrorTRIG++;
		ADC1CTL_0_ADC_SR = 1;
	}
	if (tmpAdcEIF & 0x20)		// End Of List Error => Soft Reset
	{       
		AdcErrorEOL++;
		ADC1CTL_0_ADC_SR = 1;
	}
	if (tmpAdcEIF & 0x40)		// Command Value Error => Soft Reset
	{
		AdcErrorCMD++;
		ADC1CTL_0_ADC_SR = 1;
	}
	if (tmpAdcEIF & 0x80)      	// Illegal Access Error => Soft Reset
	{
		AdcErrorIA++;
		ADC1CTL_0_ADC_SR = 1;
	}
	return;
}


/*****************************************************************************
*
* Function: void ADC0done_ISR(void)
*
* Description: ADC0 Conversion Done Interrupt Service Routine
*
*****************************************************************************/
INTERRUPT void ADC0done_ISR(void)
{
	EnableInterrupts;
	ADC0CONIF = 1;      // Clear flag
	return;
}

/***************************************************************************//*!
*
* @brief   ADC interrupt service routine for Current loop of FOC
*
* @param   void
*
* @return  none
*
******************************************************************************/
INTERRUPT void ADC1done_ISR(void)
{
	EnableInterrupts;
	ADC1CONIF = 1;      // Clear flag
	return;
}


/***************************************************************************//*!
*
* @brief   ADC interrupt service routine for Current loop of FOC
*
* @param   void
*
* @return  none
*
******************************************************************************/
unsigned char ucstatenow = 0;
unsigned char ucstateadd[500];
unsigned int uistateindex = 0;
appFaultStatus_t	permFaultssaved;
INTERRUPT void PMFreloadA_ISR(void)
{
	static tBool getFcnStatus;
	
	
	//-------------------------------------------
	// 1ms period for system schedule.
	static unsigned char suc1mscntr = 0;
	suc1mscntr++;
	if(suc1mscntr>=10) // 10*100us = 1ms
	{
		suc1mscntr = 0;
		systick_1ms();		
	}
	//--------------------------------------------
				
	EnableInterrupts;
	
	PTT_PTT0 = 1; 		// set the PTT0 pin to track the code performance
	
	// PWM Control
	// If no signal is detected, disable the PWM control
	if(pwmControlData.ControlInputClass == PWM_NoSignalDetect)
		pwmControlEnabled = false;
	else
		pwmControlEnabled = true;
	
	// If PWM input control enabled, update the demanded speed 
	if(pwmControlEnabled)
	{
		//If the linear or high signal is detected, switch the app on
		if(pwmControlData.ControlInputClass >= PWM_LinearCtrlDetect)
		{
			cntrState.usrControl.switchAppOnOff = 1;
		}
		else
		{
			cntrState.usrControl.switchAppOnOff = 0;
			if(cntrState.state == fault)
				cntrState.usrControl.switchFaultClear = true;
		}
		//Store the demanded speed
		drvFOC.pospeControl.wRotElReq = GDFLIB_FilterMA_F16(pwmControlData.outputValue, &f16pwmInputMA);
	}
	else
		GDFLIB_FilterMAInit_F16(&f16pwmInputMA);	//If PWM control disabled, keep filtering the command

	 // User accessible switch for stopping the application.
	if (cntrState.usrControl.btFlipFlop ^ cntrState.usrControl.btFlipFlopTemp)
	{
		cntrState.usrControl.btFlipFlopTemp  = cntrState.usrControl.btFlipFlop;
		cntrState.usrControl.switchAppOnOff  = (cntrState.usrControl.btFlipFlop) ? false: true;
	}
	
	// User accessible switch for stopping the application.
	if (cntrState.usrControl.switchAppOnOff ^ cntrState.usrControl.switchAppOnOffState)
	{
		cntrState.usrControl.switchAppOnOffState  = cntrState.usrControl.switchAppOnOff;
		cntrState.event   = (cntrState.usrControl.switchAppOnOff) ? e_app_on: e_app_off;
	}
						
	getFcnStatus    =    true;
	
	// Phase currents and DCB voltage measurement
	getFcnStatus  = Meas_Get3PhCurrent(&meas, &drvFOC.iAbcFbck, drvFOC.svmSector);
	getFcnStatus &= Meas_GetTemperature(&meas);
	getFcnStatus &= Meas_GetTemp_NTC(&meas);
	
	//VHT(temp) = VHT(150) - (150 - temp) * dVHT
	//(150 - temp) * dVHT = VHT(150)-VHT(temp);
	// 150*dVHT -(VHT(150)-VHT(temp) )= temp *dVHT;
	// temp = (150*dVHT -(VHT(150)-VHT(temp) ))/dVHT;
	// temp = (5.25mV/C*150 - (2.4 - (meas.measured.f16Temp.raw>>4)*5/4096))/5.25
	// temp = 150-  (2.4-(meas.measured.f16Temp.raw)*5>>16))/5.25
	// temp = 150- 2.4v/5.25mv + (meas.measured.f16Temp.raw)*5>>16)/5.25;
	// temp = 150- 457 + (meas.measured.f16Temp.raw)*5*100>>16)/525;
		

	MotorDrive_uiTemperature =((long)meas.measured.f16Temp.filt*645)>>15; //150-(31456-meas.measured.f16Temp.raw)/69;//150-(2400*100-((long)meas.measured.f16Temp.raw*5*100>>16))/525;
	
	//MotorDrive_uiTemperature =150-(1382-meas.measured.f16Temp.filt>>4)/3;//(long)((long)(meas.measured.f16Temp.filt>>3)*645)>>12;   //add for Temperature sample
    //MotorDrive_uiTemperature   =(long)((long)(meas.measured.f16Temp.filt>>3)*645)>>12;   //add for Temperature sample

