ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
	//l_u8_wr_LIN_NXP_Temperature((l_u8)(MotorDrive_uiTemperature>>4)); //refresh Temperature	
	
	//MotorDrive_uiTemperatureNTC_Digital=(long)((long)meas.measured.f16NTC.filt*645)>>12;
	//MotorDrive_uiTemperatureNTC_Digital=ADC1ResultList[0][2]>>4;// 10bit NTC digital needed.	
		
	getFcnStatus &= Meas_GetUdcVoltage(&meas, &drvFOC.uDcbFilter);
	//MotorDrive_uiVoltage= ((long)((long)(meas.measured.f16Udcb.filt>>3)*5*5*1000))>>12;   //add for voltage sample
	MotorDrive_uiVoltage= (long)((long)meas.measured.f16Udcb.filt*5*5*1000)>>15;   //add for voltage sample
	//l_u8_wr_LIN_NXP_ActVoltage((MotorDrive_uiVoltage));  //refresh voltage
	
	drvFOC.f16Udcb = meas.measured.f16Udcb.filt;
	   
	// Fault detection routine, must be executed prior application state machine
	getFcnStatus &= faultDetection();
	
	if (getFcnStatus)    
	{
		permFaultssaved = permFaults;
		cntrState.event = e_fault;
	}
	ucstatenow = cntrState.state<<4|cntrState.event;
	if(ucstatenow!=ucstateadd[uistateindex])
	{
		uistateindex++;
		if(uistateindex>499)
		{
			uistateindex = 0;	
		}
		ucstateadd[uistateindex] = ucstatenow;	
	}
	
	// Execute State table with newly measured data	
	state_table[cntrState.event][cntrState.state]();
	state_LED[cntrState.state]();

	App_count++;
	
	PTT_PTT0 = 0;			// clear the PTT0 pin to track the code performance
	
	FMSTR_Recorder();
	MotorDrive_uiActualSpeed=MLIB_Abs_F16(drvFOC.pospeSensorless.wRotEl);

	PMFFQCA_PWMRFA = 1; // Clear flag
	return;
}

/***************************************************************************//*!
*
* @brief   TIM channel 3 / input capture interrupt service routine for PWM input control evaluation
*
* @param   void
*
* @return  none
*
******************************************************************************/
INTERRUPT void TIM0chan3_ISR(void)
{
	PWMDetection_INT();
	TIM0TFLG1 = TIM0TFLG1_C3F_MASK;
	return;
	
//	// Read PWM input control pin and update status
//	if(PWMControlUpdate(TIM0TC3, &pwmControlData))
//	// Read the PWM Control output
//	pwmControlData.outputValue = PWMControlGetOutputValue(&pwmControlData);
//		
//	// Toggle edge detection
//	if(pwmControlData.flags.risingEdge)
//	{	
//		TIM0TCTL4_EDG3A = 1;
//		TIM0TCTL4_EDG3B = 0;
//	}
//	if(pwmControlData.flags.fallingEdge)
//	{
//		TIM0TCTL4_EDG3A = 0;
//		TIM0TCTL4_EDG3B = 1;
//	}
//	
//	// Clear interrupt flag
//	TIM0TFLG1 = TIM0TFLG1_C3F_MASK; //TIM0TFLG1_C0F_MASK | TIM0TFLG1_C1F_MASK | TIM0TFLG1_C2F_MASK  | TIM0TFLG1_C3F_MASK;
}
/***************************************************************************//*!
*
* @brief   TIM overflow interrupt service routine for PWM input control evaluation
*
* @param   void
*
* @return  none
*
******************************************************************************/
INTERRUPT void TIM0overflow_ISR(void)
{
	TaskAnalysis_Overflow_INT(); // 65536 uS overflow.
	
	PWM_overflow_INT();
	TIM0TFLG2 = TIM0TFLG2_TOF_MASK; 
	return;
	
	
//	// Detect PWM input control period overflow (ultra low frequencies
//	if(PWMControlTimerOverflow(&pwmControlData))
//		{
//	      PWMControlInit(&pwmControlData);
//		  //if(pwmstate == 0)
//		  //{
//		   TIM0TCTL4_EDG3A = 1;	   //Rising edge
//	       TIM0TCTL4_EDG3B = 0;    //1
//		}
//	// Clear interrupt flag
//	TIM0TFLG2 = TIM0TFLG2_TOF_MASK; 
}


/***************************************************************************//*!
*
* @brief   After reset MCAT INIT
*
* @param   
*
* @return  none
*
******************************************************************************/
void stateReset()
{
	tBool ResetFcnStatus = false;
	/*-----------------------------------------------------
	Application State Machine - state identification
	----------------------------------------------------- */
	// On entry
	if(cntrState.state != reset)
	{
		// Entering state fault
		cntrState.state   = reset;
		cntrState.event   = e_reset;
		
		Meas_Clear(&meas);
		
		// Init the DCBus filter and wait in the reset state till the DCBus charges
		// DCBus 1st order filter; Fcut = 100Hz, Ts = 100e-6
		drvFOC.uDcbFilter.trFiltCoeff.f16B0    = UDCB_IIR_B0;
		drvFOC.uDcbFilter.trFiltCoeff.f16B1    = UDCB_IIR_B1;
		drvFOC.uDcbFilter.trFiltCoeff.f16A1    = UDCB_IIR_A1;
		GDFLIB_FilterIIR1Init_F16(&drvFOC.uDcbFilter);
	}
	// Turn off and keep the Actuator's output (PWM, GDU)
	DisableOutput();
	/*------------------------------------
	 * Freemaster variables
	 * ----------------------------------*/
	fmScale.current                                      = FM_I_SCALE;
	fmScale.voltage                                      = FM_U_SCALE;
	fmScale.dcb_voltage                                  = FM_U_DCB_SCALE;
	fmScale.speed_w_e                                    = FM_SPEED_RAD_EL_SCALE;
	fmScale.speed_n_m                                    = FM_SPEED_RPM_MEC_SCALE;
	fmScale.position                                     = FM_POSITION_DEG_SCALE;
	//fmScale.speed_ramp									 = FM_SPEED_RAMP_RPM_SCALE;
	
	drvFOC.alignCntrInit							   	= ALIGN_DURATION;
	drvFOC.alignVoltage 								= ALIGN_VOLTAGE;
	
	/*------------------------------------
	 * Currents
	 * ----------------------------------*/
	drvFOC.iAbcFbck.f16Arg1                = 0;
	drvFOC.iAbcFbck.f16Arg2                = 0;
	drvFOC.iAbcFbck.f16Arg3                = 0;
	
	drvFOC.iAlBeFbck.f16Arg1               = 0;
	drvFOC.iAlBeFbck.f16Arg2               = 0;
	
	drvFOC.currentLoop.pIDQReq->f16Arg1		= 0;
	drvFOC.currentLoop.pIDQReq->f16Arg2		= 0;
	
	drvFOC.currentLoop.pIDQFbck->f16Arg1	= 0;
	drvFOC.currentLoop.pIDQFbck->f16Arg2	= 0;
	
	/*------------------------------------
	 * Voltages
	 * ----------------------------------*/
	drvFOC.uAlBeReq.f16Arg1                = 0;
	drvFOC.uAlBeReq.f16Arg2                = 0;
	
	drvFOC.uAlBeReqDCB.f16Arg1             = 0;
	drvFOC.uAlBeReqDCB.f16Arg2             = 0;
	
	drvFOC.uDQReq.f16Arg1                  = 0;
	drvFOC.uDQReq.f16Arg2                  = 0;
	
	/*------------------------------------
	 * Speed/Position
	 * ----------------------------------*/
	drvFOC.thTransform.f16Arg1             = 0;
	drvFOC.thTransform.f16Arg2             = 0;
	
