ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
	/*------------------------------------
	 * SVC-PWM variables
	 * ----------------------------------*/
	drvFOC.svmSector                       = 1;
	
	drvFOC.pwm16.f16Arg1                   = 0;
	drvFOC.pwm16.f16Arg2                   = 0;
	drvFOC.pwm16.f16Arg3                   = 0;
	
	/*------------------------------------
	 * FOC variables
	 * ----------------------------------*/
	// Current PI controllers
	drvFOC.iCLoop_Limit						= CLOOP_LIMIT;
	
	drvFOC.currentLoop.pPIrAWD.f16CC1sc		= D_CC1SC;
	drvFOC.currentLoop.pPIrAWD.f16CC2sc		= D_CC2SC;
	drvFOC.currentLoop.pPIrAWD.u16NShift	= D_NSHIFT;
	
	drvFOC.currentLoop.pPIrAWD.f16UpperLimit = CLOOP_LIMIT;
	drvFOC.currentLoop.pPIrAWD.f16LowerLimit = MLIB_Neg_F16(CLOOP_LIMIT);
	
	drvFOC.currentLoop.pPIrAWQ.f16CC1sc		= Q_CC1SC;
	drvFOC.currentLoop.pPIrAWQ.f16CC2sc		= Q_CC2SC;
	drvFOC.currentLoop.pPIrAWQ.u16NShift	= Q_NSHIFT;
	
	drvFOC.currentLoop.pPIrAWQ.f16UpperLimit = CLOOP_LIMIT;
	drvFOC.currentLoop.pPIrAWQ.f16LowerLimit = MLIB_Neg_F16(CLOOP_LIMIT);
	
	drvFOC.currentLoop.pIDQFbck				= &drvFOC.iDQFbck;
	drvFOC.currentLoop.pIDQReq				= &drvFOC.iDQReq;
	
	AMCLIB_CurrentLoopInit_F16(&drvFOC.currentLoop);
	
	drvFOC.elimDcbRip.f16ModIndex          = FRAC16(0.866025403784439);
	drvFOC.elimDcbRip.f16ArgDcBusMsr       = 0;
	
	drvFOC.pospeSensorless.dutyCycleLimit.f16UpperLimit = CLOOP_LIMIT;
	drvFOC.pospeSensorless.dutyCycleLimit.f16LowerLimit = MLIB_Neg_F16(CLOOP_LIMIT);
	
	OL_SpeedRampInc = OL_START_RAMP_INC;
	//OL_SpeedRampDec = OL_START_RAMP_DEC;
	CL_SpeedRampInc = SPEED_RAMP_UP;
	CL_SpeedRampDec = SPEED_RAMP_DOWN;
	
	drvFOC.speedRampPos.f32RampUp          = OL_SpeedRampInc;
	drvFOC.speedRampPos.f32RampDown        = OL_SpeedRampInc;			//would be OL_SpeedRampDec, if needed
	drvFOC.speedRampPos.f32State           = 0;
	
	drvFOC.speedRampNeg.f32RampUp          = OL_SpeedRampInc;
	drvFOC.speedRampNeg.f32RampDown        = OL_SpeedRampInc;			//would be OL_SpeedRampDec, if needed
	drvFOC.speedRampNeg.f32State           = 0;
	
	drvFOC.pospeControl.wRotElReq		   = 0;
	drvFOC.pospeControl.wRotEl			   = 0;
	drvFOC.pospeControl.wRotElReqRamp      = 0;
	
	drvFOC.speedLoop.pPIpAWQ.f16PropGain		= SPEED_PI_PROP_GAIN;
	drvFOC.speedLoop.pPIpAWQ.s16PropGainShift 	= SPEED_PI_PROP_SHIFT;
	drvFOC.speedLoop.pPIpAWQ.f16IntegGain		= SPEED_PI_INTEG_GAIN;
	drvFOC.speedLoop.pPIpAWQ.s16IntegGainShift	= SPEED_PI_INTEG_SHIFT;
	drvFOC.speedLoop.pPIpAWQ.f16UpperLimit		= SPEED_LOOP_HIGH_LIMIT;
	drvFOC.speedLoop.pPIpAWQ.f16LowerLimit		= SPEED_LOOP_LOW_LIMIT;
	drvFOC.speedLoop.pRamp.f32RampUp			= OL_SpeedRampInc;
	drvFOC.speedLoop.pRamp.f32RampDown			= OL_SpeedRampInc;
	drvFOC.speedLoop.pFilterW.u16NSamples		= POSPE_SPEED_FILTER_MA_NPOINT;
	
	AMCLIB_SpeedLoopInit_F16 (&drvFOC.speedLoop);
	
	// Position observer output
	drvFOC.pospeSensorless.wRotEl   	   	= 0;
	drvFOC.pospeSensorless.thRotEl		   	= 0;
	
	drvFOC.pospeSensorless.DQtoGaDeError	= 0; 		
	drvFOC.pospeSensorless.bEMFObs.pParamD.f16CC1sc        = BEMF_DQ_CC1_GAIN;
	drvFOC.pospeSensorless.bEMFObs.pParamD.f16CC2sc        = BEMF_DQ_CC2_GAIN;
	drvFOC.pospeSensorless.bEMFObs.pParamD.f16LowerLimit   = FRAC16(-1.0);
	drvFOC.pospeSensorless.bEMFObs.pParamD.f16UpperLimit   = FRAC16(1.0);
	drvFOC.pospeSensorless.bEMFObs.pParamD.u16NShift       = BEMF_DQ_NSHIFT;
	drvFOC.pospeSensorless.bEMFObs.pParamQ.f16CC1sc        = BEMF_DQ_CC1_GAIN;
	drvFOC.pospeSensorless.bEMFObs.pParamQ.f16CC2sc        = BEMF_DQ_CC2_GAIN;
	drvFOC.pospeSensorless.bEMFObs.pParamQ.f16LowerLimit   = FRAC16(-1.0);
	drvFOC.pospeSensorless.bEMFObs.pParamQ.f16UpperLimit   = FRAC16(1.0);
	drvFOC.pospeSensorless.bEMFObs.pParamQ.u16NShift       = BEMF_DQ_NSHIFT;
	drvFOC.pospeSensorless.bEMFObs.s16Shift 				= BEMF_SHIFT;
	drvFOC.pospeSensorless.bEMFObs.f16UGain					= U_GAIN;
	drvFOC.pospeSensorless.bEMFObs.f16WIGain				= WI_GAIN;
	drvFOC.pospeSensorless.bEMFObs.f16EGain					= E_GAIN;
	drvFOC.pospeSensorless.bEMFObs.f16IGain					= I_GAIN;
	
	AMCLIB_BemfObsrvDQInit_F16 (&drvFOC.pospeSensorless.bEMFObs);
	
	drvFOC.pospeSensorless.TrackObsrv.pParamPI.f16CC1sc        = TO_CC1SC;
	drvFOC.pospeSensorless.TrackObsrv.pParamPI.f16CC2sc        = TO_CC2SC;
	drvFOC.pospeSensorless.TrackObsrv.pParamPI.f16LowerLimit   = FRAC16(-1.0);
	drvFOC.pospeSensorless.TrackObsrv.pParamPI.f16UpperLimit   = FRAC16(1.0);
	drvFOC.pospeSensorless.TrackObsrv.pParamPI.u16NShift       = TO_NSHIFT;	
	drvFOC.pospeSensorless.TrackObsrv.pParamInteg.f16C1 		= TO_THETA_GAIN;
	drvFOC.pospeSensorless.TrackObsrv.pParamInteg.u16NShift 	= TO_THETA_SHIFT;
	
	AMCLIB_TrackObsrvInit_F16(&drvFOC.pospeSensorless.TrackObsrv);
	
	drvFOC.pospeSensorless.wRotEl			= 0;
	drvFOC.pospeSensorless.thRotEl			= 0;
	drvFOC.pospeSensorless.wRotElMatch_1	= MERG_SPEED_1_TRH;
	drvFOC.pospeSensorless.wRotElMatch_2	= MERG_SPEED_2_TRH;
	
	drvFOC.pospeSensorless.iQUpperLimit		= SPEED_LOOP_HIGH_LIMIT;
	drvFOC.pospeSensorless.iQLowerLimit		= SPEED_LOOP_LOW_LIMIT;
	
	drvFOC.pospeOpenLoop.integ.f16InK1 		= 0;
	drvFOC.pospeOpenLoop.integ.f32State 	= 0;
	drvFOC.pospeOpenLoop.integ.f16C1 		= SCALAR_INTEG_GAIN;
	drvFOC.pospeOpenLoop.integ.u16NShift 	= SCALAR_INTEG_SHIFT;
	
	drvFOC.pospeOpenLoop.thRotEl			= 0;
	drvFOC.pospeOpenLoop.wRotEl				= 0;
	
	drvFOC.pospeOpenLoop.iQUpperLimit		= OL_START_I;
	drvFOC.pospeOpenLoop.iQLowerLimit		= MLIB_Neg_F16(drvFOC.pospeOpenLoop.iQUpperLimit);
	
	// Scalar control
	drvFOC.scalarControl.VHzRatioReq		= SCALAR_VHZ_FACTOR_GAIN;
	drvFOC.scalarControl.VHzRatioReq_Shift	= SCALAR_VHZ_FACTOR_SHIFT;
	
	// Decoupling
	//GMCLIB_DECOUPLINGPMSM_T_F16		decouplingPar;	// Ld-Lq decoupling
	drvFOC.decouplingPar.f16Kd 				= FRAC16(0.295678);		//Lq * wmax * Imax/Umax = 25.1 uH * 2356.194 * 125 / 25
	drvFOC.decouplingPar.s16KdShift			= 0;
	drvFOC.decouplingPar.f16Kq				= FRAC16(0.200276);		//Ld * wmax * Imax/Umax = 17.0 uH * 2356.194 * 125 / 25
	drvFOC.decouplingPar.s16KqShift			= 0;
	
	SWLIBS_2Syst_F16				uDQdecoupled;	// Udq voltage after decoupling
	
	
	// Default mode of operation
	cntrState.usrControl.controlMode		= automatic;
	pos_mode								= force;
	
    //PWM input control
	pwmControlData.config.noSignalLevel		= FRAC16(0.05);					// No signal detected below 5%
	pwmControlData.config.noSignalOutput	= 0;							// No signal output
	pwmControlData.config.hystLowSignalOff	= FRAC16(0.1);					// Low signal off at 10%
	pwmControlData.config.hystLowSignalOn	= FRAC16(0.15);					// Low signal on at 15%
	pwmControlData.config.linearSignalLevelMax	= FRAC16(0.85);				// Linear signal max at 85%
	pwmControlData.config.linearSignalOutputMax = FRAC16(2650.0/N_MAX);		// Max output set to nominal speed
	pwmControlData.config.linearSignalOutputMin = MERG_SPEED_2_TRH;			// Min output set to Merge2 speed
	pwmControlData.config.linearSignalSlope	= FRAC16(0.68254);				// Linear slope calculated as (2650/4500 - 500/4500) / (0.85 - 0.15)
	pwmControlData.config.linearSignalShift		= FRAC16(0.00873);			// Linear shift calculated as 500/4500 - 0.68254 * 0.15
	pwmControlData.config.lowSignalOutput	= 0;							// Low signal output
	pwmControlData.config.maxPeriod			= 62500;   //8HZ     25000;	    // Max period corresponds to 20 Hz with f_bus/50 precision prescaler
	pwmControlData.config.minPeriod			= 495;   //12HZ      495;		// Min period corresponds to 1 kHz with f_bus/50 precision prescaler

	
	PWMControlInit(&pwmControlData);
	EnableTIM();
	
	// Resets the filter with the measured raw values and waits for the DCBus to be charged
	if(meas.measured.f16Udcb.raw > 0)
	{
		drvFOC.uDcbFilter.f16FiltBufferX[0] = meas.measured.f16Udcb.raw;
		drvFOC.uDcbFilter.f32FiltBufferY[0] = MLIB_Convert_F32F16((tFrac16) meas.measured.f16Udcb.raw, FRAC16(1.0));
		
		if(meas.measured.f16Udcb.raw < U_DCB_UNDERVOLTAGE)	// If low voltage, stay in the reset state
			ResetFcnStatus = false;
		else												// else report reset done
			ResetFcnStatus = true; 	
	}
	
	if (ResetFcnStatus)
	{
		// Initialisation phase successfully done
		cntrState.event   = e_reset_done;  // prepare for transition to next state.
	}
	return;
}

/***************************************************************************//*!
*
* @brief   FAULT state
*
* @param   
*
* @return  none
*
******************************************************************************/
void stateFault()
{
    /*-----------------------------------------------------
    Application State Machine - state identification
    ----------------------------------------------------- */
    // Entering state fault
	cntrState.state   = fault;
	cntrState.event   = e_fault;

	// Turn off Actuator's output (PWM, GDU)
	DisableOutput();
	
