ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
	// Indicate State Machine fault state invoked by irrelevant event call
	if((permFaults.mcu.R == 0)&&(permFaults.motor.R == 0)&&(permFaults.stateMachine.R == 0))
		permFaults.stateMachine.B.FOCError = 1;
	
    // Disable user application switch
    cntrState.usrControl.switchAppOnOff      = false;
    cntrState.usrControl.switchAppOnOffState = false;
    
    // Clear fault by FreeMASTER command.
    if (cntrState.usrControl.switchFaultClear)
    {
    	if(ClearDriverError() && ClearPMF_Faults() && ClearPTU_Errors())
    	{
			// Clear all of the HW/MCU faults such as GDU, PWM, ...

			// Clear permanent SW faults
			permFaults.mcu.R          = 0x0;      // Clear mcu faults
			permFaults.motor.R		  = 0x0;	  // Clear motor faults
			permFaults.stateMachine.R = 0x0;	  // Clear state machine faults
	
			// When all Faults cleared prepare for transition to next state.
			cntrState.usrControl.readFault             = true;
			cntrState.usrControl.switchFaultClear      = false;
			cntrState.event                            = e_fault_clear;
    	}
    }
	return;
}

/***************************************************************************//*!
*
* @brief   INIT state
*
* @param   
*
* @return  none
*
******************************************************************************/
void stateInit( )
{
    /*-----------------------------------------------------
    Application State Machine - state identification
    ----------------------------------------------------- */
    tBool InitFcnStatus;
    cntrState.state                              = init;
    cntrState.event								 = e_init;

    //Switch off PWM output, GDU output
    DisableOutput();

    /*------------------------------------
     * General use variables
     * ----------------------------------*/
    InitFcnStatus                                         = false;

    /*------------------------------------
     * Application state machine variables
     * ----------------------------------*/
    // Reset state of all user control variables
    cntrState.usrControl.switchAppOnOff                      = false;
    cntrState.usrControl.switchAppOnOffState                 = false;
    cntrState.usrControl.switchFaultClear                    = false;
    cntrState.usrControl.switchAppReset                      = false;
    
    cntrState.usrControl.ledCounter							 = 0;
    cntrState.usrControl.ledFlashing						 = 1250;


    drvFOC.pospeControl.speedLoopCntr                       = 0;
    
    drvFOC.alignCntr								   	= drvFOC.alignCntrInit;
    
    InitFcnStatus = Meas_Clear(&meas);
    meas.param.u16CalibSamples                         = 10;    // number of samples = 2^u16CalibSamples
    meas.offset.f16Idcb.filtParam.u16NSamples		   = meas.param.u16CalibSamples;
 
    
    /*------------------------------------
     * Currents
     * ----------------------------------*/
    drvFOC.iAbcFbck.f16Arg1                = 0;
    drvFOC.iAbcFbck.f16Arg2                = 0;
    drvFOC.iAbcFbck.f16Arg3                = 0;

    drvFOC.iAlBeFbck.f16Arg1               = 0;
    drvFOC.iAlBeFbck.f16Arg2               = 0;
    
	drvFOC.currentLoop.pIDQReq->f16Arg1		= 0;
	drvFOC.currentLoop.pIDQReq->f16Arg2		= 0;

	drvFOC.currentLoop.pIDQFbck->f16Arg1	= 0;
	drvFOC.currentLoop.pIDQFbck->f16Arg2	= 0;
    
    drvFOC.pospeOpenLoop.iQLowerLimit		= MLIB_Neg_F16(drvFOC.pospeOpenLoop.iQUpperLimit);
    
    drvFOC.pospeSensorless.dutyCycleLimit.f16UpperLimit = drvFOC.iCLoop_Limit;
    drvFOC.pospeSensorless.dutyCycleLimit.f16LowerLimit = MLIB_Neg_F16(drvFOC.iCLoop_Limit);
    

    /*------------------------------------
     * Voltages
     * ----------------------------------*/
    drvFOC.uAlBeReq.f16Arg1                = 0;
    drvFOC.uAlBeReq.f16Arg2                = 0;

    drvFOC.uAlBeReqDCB.f16Arg1             = 0;
    drvFOC.uAlBeReqDCB.f16Arg2             = 0;

    drvFOC.uDQReq.f16Arg1                  = 0;
    drvFOC.uDQReq.f16Arg2                  = 0;

    /*------------------------------------
     * Speed/Position
     * ----------------------------------*/
    drvFOC.thTransform.f16Arg1             = 0;
    drvFOC.thTransform.f16Arg2             = 0;

    /*------------------------------------
     * SVC-PWM variables
     * ----------------------------------*/
    drvFOC.svmSector                       = 1;

    drvFOC.pwm16.f16Arg1                   = 0;
    drvFOC.pwm16.f16Arg2                   = 0;
    drvFOC.pwm16.f16Arg3                   = 0;

    /*------------------------------------
     * FOC variables
     * ----------------------------------*/
    
    AMCLIB_CurrentLoopInit_F16(&drvFOC.currentLoop);

    drvFOC.elimDcbRip.f16ModIndex          = FRAC16(0.866025403784439);
    drvFOC.elimDcbRip.f16ArgDcBusMsr       = 0;
 
    drvFOC.speedRampPos.f32RampUp          = OL_SpeedRampInc;
    drvFOC.speedRampPos.f32RampDown        = OL_SpeedRampInc;
    drvFOC.speedRampPos.f32State           = 0;
    
    drvFOC.speedRampNeg.f32RampUp          = OL_SpeedRampInc;
    drvFOC.speedRampNeg.f32RampDown        = OL_SpeedRampInc;
    drvFOC.speedRampNeg.f32State           = 0;
 
    AMCLIB_SpeedLoopInit_F16 (&drvFOC.speedLoop);
    
    drvFOC.pospeControl.wRotEl			   = 0;
    drvFOC.pospeControl.wRotElReqRamp      = 0;

    // Position observer
    drvFOC.pospeSensorless.wRotEl   	   	= 0;
    drvFOC.pospeSensorless.thRotEl		   	= 0;
    drvFOC.pospeSensorless.DQtoGaDeError	= 0;
    
    AMCLIB_BemfObsrvDQInit_F16 (&drvFOC.pospeSensorless.bEMFObs);
    AMCLIB_TrackObsrvInit_F16(&drvFOC.pospeSensorless.TrackObsrv);

    drvFOC.pospeOpenLoop.thRotEl			= 0;
    drvFOC.pospeOpenLoop.wRotEl				= 0;
    drvFOC.pospeOpenLoop.integ.f16InK1		= 0;
    drvFOC.pospeOpenLoop.integ.f32State		= 0;
    
    // Decoupling
    drvFOC.uDQdecoupled.f16Arg1				= 0;
    drvFOC.uDQdecoupled.f16Arg2				= 0;
 
    // Default mode of operation
    cntrState.usrControl.controlMode		= automatic;
    pos_mode								= force;

    if (!InitFcnStatus)
    {
    	// Fault in initialisation state
        tempfaults.stateMachine.B.InitError = 1;		// Mark the initialisation fault
        cntrState.event                     = e_fault;	// prepare for transition to fault state.
    }
    else
    {
    	// Initialisation phase successfully done
    	cntrState.event   = e_init_done;  // prepare for transition to next state.
    }
	return;
}

/***************************************************************************//*!
*
* @brief   READY state
*
* @param   
*
* @return  none
*
******************************************************************************/
void stateReady()
{
    /*-----------------------------------------------------
    Application State Machine - state identification
    ----------------------------------------------------- */
    cntrState.state   = ready;
    cntrState.event   = e_ready;

	//PMFCFG2_MSK  = 0x0;
	//Set_Bridge_DutyCycle(2,0,0); 
    
    if(cntrState.usrControl.switchAppReset == true)
    {
    	cntrState.event = e_reset;
    	cntrState.usrControl.switchAppReset = false;
    }
	
    if(Runcommand)
    {
    	cntrState.usrControl.btFlipFlop=0; 
        cntrState.usrControl.btFlipFlopTemp=1;
    }
    	else
    {
    	cntrState.usrControl.btFlipFlop=1; 
        cntrState.usrControl.btFlipFlopTemp=0;
    }
	
	return;
}

/***************************************************************************//*!
*
* @brief   CALIBRATION state - ADC calibration state
*
* @param   
*
* @return  none
*
******************************************************************************/
void stateCalib()
{
    /*-----------------------------------------------------
      Application State Machine - state identification
    ----------------------------------------------------- */
    tBool           CalibStatus;

    cntrState.state    = calib;
    cntrState.event    = e_calib;
    CalibStatus        = false;

    // Turn off actuator output
    DisableOutput();

    CalibStatus = Meas_CalibCurrentSense(&meas, drvFOC.svmSector);

    // Apply 0.5 duty cycle
    drvFOC.pwm16.f16Arg1 = FRAC16(0.5);
    drvFOC.pwm16.f16Arg2 = FRAC16(0.5);
    drvFOC.pwm16.f16Arg3 = FRAC16(0.5);

