ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
    SetDutycycle(&drvFOC.pwm16, 2);

    // Exit the calibration state when DC calibration is done for all sectors
    if (CalibStatus)
    {
    	// Calibration sequence has successfully finished
		cntrState.event               = e_calib_done;    
    }
	return;
}

/***************************************************************************//*!
*
* @brief   ALIGNMENT state - motor control d-axes alignment
*
* @param   
*
* @return  none
*
******************************************************************************/
void stateAlign( )
{
    /*-----------------------------------------------------
    Application State Machine - state identification
    ----------------------------------------------------- */
    tBool           AlignStatus;

    cntrState.state   = align;
    cntrState.event   = e_align;

    // Turn on Actuator output on (PWM,GDU)
    EnableOutput();

    // Align sequence is at the beginning
    AlignStatus     = true;

    drvFOC.uDQReq.f16Arg1      = drvFOC.alignVoltage;
    drvFOC.uDQReq.f16Arg2      = FRAC16(0);

    drvFOC.thTransform.f16Arg1 = GFLIB_Sin(0);
    drvFOC.thTransform.f16Arg2 = GFLIB_Cos(0);

    GMCLIB_ParkInv(&(drvFOC.uAlBeReq),&(drvFOC.thTransform),&(drvFOC.uDQReq));
    drvFOC.svmSector = GMCLIB_SvmStd(&(drvFOC.pwm16),&(drvFOC.uAlBeReq));

    // when alignment time elapse
    if (--(drvFOC.alignCntr)<=0)
    {
    	if(cntrState.usrControl.FOCcontrolMode == speedControl)
    	{
			// Set state of the current loop to avoid a step change of the current
			AMCLIB_CurrentLoopSetState_F16(drvFOC.uDQReq.f16Arg1, drvFOC.uDQReq.f16Arg2, &drvFOC.currentLoop);
			
			drvFOC.currentLoop.pIDQReq->f16Arg1 = drvFOC.currentLoop.pIDQFbck->f16Arg1;
			drvFOC.currentLoop.pIDQReq->f16Arg2 = FRAC16(0.0);
			
			AMCLIB_CurrentLoop_F16(drvFOC.iCLoop_Limit, &drvFOC.uDQReq, &drvFOC.currentLoop);
    	}
    	else
    	{
    		drvFOC.currentLoop.pIDQReq->f16Arg1 = FRAC16(0.0);
    		drvFOC.currentLoop.pIDQReq->f16Arg2 = FRAC16(0.0);
    		
    		AMCLIB_CurrentLoopInit_F16(&drvFOC.currentLoop);
    		drvFOC.uDQReq.f16Arg1      = FRAC16(0.0);
    		drvFOC.uDQReq.f16Arg2      = FRAC16(0.0);
    	}
    	drvFOC.svmSector = 2;
        if (!AlignStatus)
        {
        	tempfaults.stateMachine.B.AlignError     = 1;
        }
        else
        {
        	cntrState.event           = e_align_done;
        }
    }

    SetDutycycle(&drvFOC.pwm16, drvFOC.svmSector);
	return;
}

/***************************************************************************//*!
*
* @brief   RUN state
*
* @param   none
*
* @return  none
*
******************************************************************************/
static tFrac16 newPospeSensorlessThRotEl = 0;
static tFrac16 newPospeSensorlessWRotEl = 0;

static tBool useOldValues = false;

void stateRun( )
{
    static tBool stateRunStatus;
    
    static tBool trackingToSensorless = false; 
    
    stateRunStatus = false;
    
    /*-----------------------------------------------------
    Application State Machine - state identification
    ----------------------------------------------------- */
    cntrState.state   = run;
    cntrState.event   = e_run;

    /*-----------------------------------------------------
        Calculate positions
     ----------------------------------------------------- */
    drvFOC.pospeControl.wRotElReqRamp = MLIB_Convert_F16F32(drvFOC.speedLoop.pRamp.f32State, FRAC32(1.0));
    drvFOC.pospeOpenLoop.wRotEl  = drvFOC.pospeControl.wRotElReqRamp;
    drvFOC.pospeOpenLoop.thRotEl = GFLIB_IntegratorTR_F16(drvFOC.pospeControl.wRotElReqRamp,&drvFOC.pospeOpenLoop.integ);
	
    
    // Start calculation of the Bemf Observer in tracking mode 
    if(pos_mode!=force)
    {
    	
    	drvFOC.pospeSensorless.DQtoGaDeError=AMCLIB_BemfObsrvDQ_F16(&drvFOC.iAlBeFbck, &drvFOC.uAlBeReq, drvFOC.pospeSensorless.wRotEl, drvFOC.pospeSensorless.thRotEl, &drvFOC.pospeSensorless.bEMFObs);
    	if(useOldValues)
    		AMCLIB_TrackObsrv_F16(drvFOC.pospeSensorless.DQtoGaDeError, &newPospeSensorlessThRotEl,  &newPospeSensorlessWRotEl, &drvFOC.pospeSensorless.TrackObsrv );
    	else
    		AMCLIB_TrackObsrv_F16(drvFOC.pospeSensorless.DQtoGaDeError, &drvFOC.pospeSensorless.thRotEl,  &drvFOC.pospeSensorless.wRotEl, &drvFOC.pospeSensorless.TrackObsrv );
    }

    if(useOldValues)
    	drvFOC.pospeOpenLoop.thDifOpenLEstim = MLIB_Sub_F16(newPospeSensorlessThRotEl, drvFOC.pospeOpenLoop.thRotEl);
    else
    	drvFOC.pospeOpenLoop.thDifOpenLEstim = MLIB_Sub_F16(drvFOC.pospeSensorless.thRotEl, drvFOC.pospeOpenLoop.thRotEl);
	/*-----------------------------------------------------
	Get positions according to selected mode
	----------------------------------------------------- */
	// Selecting 0 will disable the "AUTOMATIC MODE"
	// where the transition from open loop to sensorless in performed automaticaly
	// Selecting 1 will enable the "USER mode"
	// where user decide whether to switch to force mode, tracking mode, sensorless mode
    
    //(MLIB_Abs_F16(drvFOC.pospeOpenLoop.wRotEl)*3000)>>15;  //add for El. speed output
    //l_u16_wr_LIN_NXP_ActSpeed((MotorDrive_uiActualSpeed/11));                //refresh actspeed
    
	if (cntrState.usrControl.controlMode == automatic)
	{
		//Automatic Mode switch
		if (MLIB_Abs_F16(drvFOC.pospeOpenLoop.wRotEl) < drvFOC.pospeSensorless.wRotElMatch_1)	// Use open-loop for speeds below the Match1
		{
			pos_mode = force;
			trackingToSensorless = false;
		}
		else
		{
			if (MLIB_Abs_F16(drvFOC.pospeOpenLoop.wRotEl) >= drvFOC.pospeSensorless.wRotElMatch_1 &&	// Switch to tracking between Match1 and Match2 
					MLIB_Abs_F16(drvFOC.pospeOpenLoop.wRotEl) < drvFOC.pospeSensorless.wRotElMatch_2) 
			{
				pos_mode = tracking;
				
			}
			else																				// Switch to sensorles above Match2
			{
				if(!trackingToSensorless)	// Just once the sensorless is entered, the speed PI controller needs to be reset to avoid step current changes 
				{
					trackingToSensorless = true;
					AMCLIB_CurrentLoopSetState_F16(drvFOC.uDQReq.f16Arg1, drvFOC.uDQReq.f16Arg2, &drvFOC.currentLoop);
					AMCLIB_SpeedLoopSetState_F16(drvFOC.pospeOpenLoop.wRotEl, drvFOC.iDQFbck.f16Arg2, MLIB_Convert_F32F16(drvFOC.pospeOpenLoop.wRotEl, FRAC16(1.0)), &drvFOC.speedLoop);
				}
				pos_mode = sensorless1;
			}
		}
		MotorDrive_MotorStatus=pos_mode;    //add motor state
	}
	
	// user/automatics decides whether to switch to force mode, tracking mode, sensorless mode
	switch (pos_mode)
	{
		case force:
			drvFOC.speedLoop.pPIpAWQ.f16UpperLimit = drvFOC.pospeOpenLoop.iQUpperLimit;
			drvFOC.speedLoop.pPIpAWQ.f16LowerLimit = MLIB_Neg_F16(drvFOC.speedLoop.pPIpAWQ.f16UpperLimit);
			
			drvFOC.pospeControl.thRotEl = drvFOC.pospeOpenLoop.thRotEl;
			drvFOC.pospeControl.wRotEl	= 0;
			
			drvFOC.speedRampPos.f32RampUp             = OL_SpeedRampInc;
			drvFOC.speedRampPos.f32RampDown           = OL_SpeedRampInc;
			
