ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
			drvFOC.speedRampNeg.f32RampUp             = OL_SpeedRampInc;
			drvFOC.speedRampNeg.f32RampDown           = OL_SpeedRampInc;
			
			drvFOC.pospeSensorless.wRotEl			= 0;
			drvFOC.pospeSensorless.thRotEl			= 0;
			
			AMCLIB_BemfObsrvDQInit_F16 (&drvFOC.pospeSensorless.bEMFObs);
					    
			drvFOC.pospeSensorless.TrackObsrv.pParamPI.f32Acc 		= MLIB_Convert_F32F16(drvFOC.pospeOpenLoop.wRotEl, FRAC16(1.0));
		    drvFOC.pospeSensorless.TrackObsrv.pParamInteg.f32State 	= MLIB_Convert_F32F16(drvFOC.pospeOpenLoop.thRotEl, FRAC16(1.0));
		break;
		case tracking:			
			drvFOC.pospeControl.thRotEl = drvFOC.pospeOpenLoop.thRotEl;
			drvFOC.pospeControl.wRotEl	= 0;	
			
			drvFOC.speedRampPos.f32RampUp             = OL_SpeedRampInc;
			drvFOC.speedRampPos.f32RampDown           = OL_SpeedRampInc;
			
			drvFOC.speedRampNeg.f32RampUp             = OL_SpeedRampInc;
			drvFOC.speedRampNeg.f32RampDown           = OL_SpeedRampInc;
		break;
		case sensorless1:
			drvFOC.speedLoop.pPIpAWQ.f16UpperLimit = drvFOC.pospeSensorless.iQUpperLimit;
			drvFOC.speedLoop.pPIpAWQ.f16LowerLimit = drvFOC.pospeSensorless.iQLowerLimit;
			
			drvFOC.pospeControl.thRotEl = drvFOC.pospeSensorless.thRotEl;
			drvFOC.pospeControl.wRotEl	= drvFOC.pospeSensorless.wRotEl;	

			drvFOC.speedRampPos.f32RampUp          = CL_SpeedRampInc;
			drvFOC.speedRampPos.f32RampDown        = CL_SpeedRampDec;
			
			drvFOC.speedRampNeg.f32RampUp          = CL_SpeedRampInc;  //CL_SpeedRampDec;
			drvFOC.speedRampNeg.f32RampDown        = CL_SpeedRampDec;  //CL_SpeedRampInc;
			
			drvFOC.pospeOpenLoop.integ.f32State = MLIB_Convert_F32F16(drvFOC.pospeSensorless.thRotEl, FRAC16(1.0));
		break;
	}
	

	/*-----------------------------------------------------
	    Calculate Field Oriented Control FOC
	----------------------------------------------------- */
	// Slow loop
    if (++drvFOC.pospeControl.speedLoopCntr>=SPEED_LOOP_CNTR)
    {
        drvFOC.pospeControl.speedLoopCntr    = 0;
        
        stateRunStatus  = focSlowLoop();
        if (!stateRunStatus)
        {
        	tempfaults.stateMachine.B.RunError = 1;
        }
    }

    // Fast loop
    stateRunStatus = focFastLoop();
    
    if (!stateRunStatus)
    {
    	tempfaults.stateMachine.B.RunError = 1;
    }

    SetDutycycle(&drvFOC.pwm16, drvFOC.svmSector);
    
	return;
}


/***************************************************************************//*!
*
* @brief   Field Oriented Control - slow loop calculations
*
* @param   
*
* @return  none
*
******************************************************************************/
static tBool focSlowLoop()
{
	tFrac16 current = 0;
	tFrac16 weight = 0;
	SWLIBS_2Syst_F16 tempIDQReq;
	
	if(cntrState.usrControl.FOCcontrolMode != speedControl)
	{
		// required speed for open loop start-up in sensorless mode = MERG_SPEED_1_TRH*1.5
		//wRotElReq = MERG_SPEED_1_TRH * 9.55 * 1.5 / pp = MERG_SPEED_1_TRH * 4.775 = ((MERG_SPEED_1_TRH*Frac16(0.596875)) << 3;
		if (cntrState.usrControl.FOCcontrolMode == voltageControl && drvFOC.uDQReq.f16Arg2==0) 
			drvFOC.pospeControl.wRotElReq = 0;
		else if (cntrState.usrControl.FOCcontrolMode == currentControl && drvFOC.currentLoop.pIDQReq->f16Arg2==0) 
			drvFOC.pospeControl.wRotElReq = 0;
		else if (cntrState.usrControl.FOCcontrolMode != scalarControl) 
			drvFOC.pospeControl.wRotElReq = MLIB_ShL_F16(MLIB_Mul_F16(FRAC16(0.75),MERG_SPEED_1_TRH),1);
	}
	
	// Switch the ramp based on the direction
	if(drvFOC.pospeControl.wRotElReqRamp >= 0)
	{
		drvFOC.speedLoop.pRamp.f32RampUp = drvFOC.speedRampPos.f32RampUp;
		drvFOC.speedLoop.pRamp.f32RampDown = drvFOC.speedRampPos.f32RampDown;
	}
	else
	{
		drvFOC.speedLoop.pRamp.f32RampUp = drvFOC.speedRampNeg.f32RampUp;
		drvFOC.speedLoop.pRamp.f32RampDown = drvFOC.speedRampNeg.f32RampDown;
	}
	// Limit the speed to 0.95 to prevent the controllers from saturation
	//if(drvFOC.pospeControl.wRotElReq > FRAC16(0.95))
	//	drvFOC.pospeControl.wRotElReq = FRAC16(0.95);
	//if(drvFOC.pospeControl.wRotElReq < FRAC16(-0.95))
	//	drvFOC.pospeControl.wRotElReq = FRAC16(-0.95);
	
	// Speed FO control mode
	drvFOC.pospeControl.wRotElErr = MLIB_Sub_F16(drvFOC.pospeControl.wRotElReq, drvFOC.pospeControl.wRotEl);
	AMCLIB_SpeedLoop_F16(drvFOC.pospeControl.wRotElReq, drvFOC.pospeControl.wRotEl, &tempIDQReq, &drvFOC.speedLoop);
	
	if(cntrState.usrControl.FOCcontrolMode == speedControl)
	{
		// Q-axis start-up
		//drvFOC.currentLoop.pIDQReq->f16Arg2         	= GFLIB_ControllerPIpAW(drvFOC.pospeControl.wRotElErr,&drvFOC.speedPI);
		
		// D to Q axis start-up 
		
		//AMCLIB_SpeedLoop_F16(drvFOC.pospeControl.wRotElReq, drvFOC.pospeControl.wRotEl, drvFOC.currentLoop.pIDQReq, &drvFOC.speedLoop);
		
		// In the force mode, open-loop algorithm is calculated based on the open-loop limits and loop parameters
		// In the tracking mode, a smooth transition from the open-loop to the closed-loop is performed by moving
		// 		the reference frame from D-axis to Q-axis, keeping the size of the current vector the same. Similar
		//		approach can be used for changing the speed controller limits from the open-loop to the closed-loop limits.
		//		The concept uses "weight" to calculate the actual speed relative to the Match1 - Match2 interval.
		// In the sensorless mode, closed-loop parameters are used to calculate the control loop.
		switch(pos_mode)
		{
		case force:
			current = drvFOC.pospeOpenLoop.iQUpperLimit;
			weight = 0;
			drvFOC.currentLoop.pIDQReq->f16Arg1 = current;
			drvFOC.currentLoop.pIDQReq->f16Arg2 = 0;
			drvFOC.speedLoop.pPIpAWQ.f16UpperLimit = drvFOC.pospeOpenLoop.iQUpperLimit;
			drvFOC.speedLoop.pPIpAWQ.f16LowerLimit = MLIB_Neg_F16(drvFOC.speedLoop.pPIpAWQ.f16UpperLimit);
			break;
		case tracking:
			current = drvFOC.pospeOpenLoop.iQUpperLimit;
			weight = MLIB_SubSat_F16(MLIB_Abs_F16(drvFOC.pospeOpenLoop.wRotEl),drvFOC.pospeSensorless.wRotElMatch_1);
			weight = MLIB_DivSat_F16(weight, MLIB_SubSat_F16(drvFOC.pospeSensorless.wRotElMatch_2,drvFOC.pospeSensorless.wRotElMatch_1));
			drvFOC.currentLoop.pIDQReq->f16Arg1 = MLIB_Mul_F16(GFLIB_Sqrt_F16(MLIB_SubSat_F16(FRAC16(1.0),weight)),current);
			drvFOC.currentLoop.pIDQReq->f16Arg2 = MLIB_Mul_F16(GFLIB_Sqrt_F16(weight),current);
			/* DISABLED for fan applications, where the load current is increasing with speed
			// Variable speed PI controller output limit between merging speed 1 and 2
			drvFOC.speedPI.f16UpperLimit = MLIB_AddSat_F16(
						MLIB_Mul_F16(drvFOC.pospeOpenLoop.iQUpperLimit, MLIB_SubSat_F16(FRAC16(1.0),weight)),
						MLIB_Mul_F16(drvFOC.pospeSensorless.iQUpperLimit,weight));
			drvFOC.speedPI.f16LowerLimit = MLIB_AddSat_F16(
					MLIB_Mul_F16(drvFOC.pospeOpenLoop.iQLowerLimit, MLIB_SubSat_F16(FRAC16(1.0),weight)),
					MLIB_Mul_F16(drvFOC.pospeSensorless.iQLowerLimit,weight));
			*/
			break;
		case sensorless1:
			current = tempIDQReq.f16Arg2;
			weight = FRAC16(1.0);
			drvFOC.currentLoop.pIDQReq->f16Arg1 = 0;
			drvFOC.currentLoop.pIDQReq->f16Arg2 = current;
			drvFOC.speedLoop.pPIpAWQ.f16UpperLimit = drvFOC.pospeSensorless.iQUpperLimit;
			drvFOC.speedLoop.pPIpAWQ.f16LowerLimit = drvFOC.pospeSensorless.iQLowerLimit;
			break;
		}
	}
	
