ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
    return true;
}

/***************************************************************************//*!
*
* @brief   Field Oriented Control - fast loop calculations
*
* @param   
*
* @return  none
*
******************************************************************************/
volatile unsigned int dPI = 1, qPI = 1;
volatile tBool useDecoupling = false;
volatile tFrac16 thetaOffset = 0;
static tBool focFastLoop()
{
	GMCLIB_Clark(&drvFOC.iAlBeFbck,&drvFOC.iAbcFbck);
	
	// Scalar control mode
	if(cntrState.usrControl.FOCcontrolMode == scalarControl)
	{
		// generated electrical position for scalar control purpose
		// Required voltage = VHzRatio * Required Frequency
		drvFOC.scalarControl.UmReq	  	= MLIB_ShL_F16(MLIB_Mul(drvFOC.scalarControl.VHzRatioReq,drvFOC.pospeControl.wRotElReqRamp),drvFOC.scalarControl.VHzRatioReq_Shift);

		// thRotEl is calculated in CalcOpenLoop executed in focSlowLoop
		drvFOC.thTransform.f16Arg1     = GFLIB_Sin(drvFOC.pospeControl.thRotEl);
		drvFOC.thTransform.f16Arg2     = GFLIB_Cos(drvFOC.pospeControl.thRotEl);

		drvFOC.uDQReq.f16Arg1          = 0;
		drvFOC.uDQReq.f16Arg2          = drvFOC.scalarControl.UmReq;
		
		// enable Bemf observer  
		cntrState.usrControl.controlMode = manual;
		pos_mode = tracking;
	}
	
	// DQ Voltage FO control mode
	if(cntrState.usrControl.FOCcontrolMode == voltageControl)
	{
		if(drvFOC.uDQReq.f16Arg2!=0)
		{
			drvFOC.thTransform.f16Arg1     = GFLIB_Sin(drvFOC.pospeControl.thRotEl);
			drvFOC.thTransform.f16Arg2     = GFLIB_Cos(drvFOC.pospeControl.thRotEl);
		}
		else
		{
			drvFOC.thTransform.f16Arg1     = 0;
			drvFOC.thTransform.f16Arg2     = FRAC16(FRACT_MAX);
		}
	
		GMCLIB_Park(&drvFOC.iDQFbck,&drvFOC.thTransform,&drvFOC.iAlBeFbck);
	}
	
	// DQ Current and Speed FO control mode
	if(cntrState.usrControl.FOCcontrolMode == currentControl || cntrState.usrControl.FOCcontrolMode == speedControl)
	{
		if(cntrState.usrControl.FOCcontrolMode == speedControl)
		{
			drvFOC.thTransform.f16Arg1     = GFLIB_Sin(drvFOC.pospeControl.thRotEl);
			drvFOC.thTransform.f16Arg2     = GFLIB_Cos(drvFOC.pospeControl.thRotEl);
		}
		else
		{
			if(drvFOC.currentLoop.pIDQReq->f16Arg2==0)
			{
				drvFOC.thTransform.f16Arg1     = 0;
				drvFOC.thTransform.f16Arg2     = FRAC16(FRACT_MAX);
			}
			else
			{
				drvFOC.thTransform.f16Arg1     = GFLIB_Sin(drvFOC.pospeControl.thRotEl);
				drvFOC.thTransform.f16Arg2     = GFLIB_Cos(drvFOC.pospeControl.thRotEl);
			}
		}

		GMCLIB_Park(&drvFOC.iDQFbck,&drvFOC.thTransform,&drvFOC.iAlBeFbck);
		
		AMCLIB_CurrentLoop_F16(drvFOC.iCLoop_Limit, &drvFOC.uDQReq, &drvFOC.currentLoop);
	}
	//////////////////////////////////////
	if(useOldValues)
	{
		drvFOC.pospeSensorless.thRotEl	= MLIB_Add_F16(newPospeSensorlessThRotEl, thetaOffset);
		drvFOC.pospeSensorless.wRotEl 	= newPospeSensorlessWRotEl;
	}
	
	/* Decoupling */
	GMCLIB_DecouplingPMSM_F16 (&drvFOC.uDQdecoupled, &drvFOC.uDQReq, &drvFOC.iDQFbck, drvFOC.pospeControl.wRotEl, &drvFOC.decouplingPar);
	
	if(useDecoupling)
		GMCLIB_ParkInv(&drvFOC.uAlBeReq,&drvFOC.thTransform,&drvFOC.uDQdecoupled);
	else
		GMCLIB_ParkInv(&drvFOC.uAlBeReq,&drvFOC.thTransform,&drvFOC.uDQReq);

	// DC Bus ripple elimination
	drvFOC.elimDcbRip.f16ArgDcBusMsr  = useRawDCBusForElim ? meas.measured.f16Udcb.raw : meas.measured.f16Udcb.filt;
	GMCLIB_ElimDcBusRip(&drvFOC.uAlBeReqDCB,&drvFOC.uAlBeReq,&drvFOC.elimDcbRip);
	
	/// The output needs to be limited to prevent the duty cycle to be higher than expected.
	//  Otherwise ADC restart error may occur due to the triggers placed too early after the reload
	drvFOC.uAlBeReqDCB.f16Arg1 = GFLIB_Limit_F16(drvFOC.uAlBeReqDCB.f16Arg1, &drvFOC.pospeSensorless.dutyCycleLimit);
	drvFOC.uAlBeReqDCB.f16Arg2 = GFLIB_Limit_F16(drvFOC.uAlBeReqDCB.f16Arg2, &drvFOC.pospeSensorless.dutyCycleLimit);

	drvFOC.svmSector   = GMCLIB_SvmStd(&(drvFOC.pwm16),&drvFOC.uAlBeReqDCB);

    return (true);
}


/***************************************************************************//*!
*
* @brief   Fault Detection function
*
* @param   none
*
* @return  none
*
******************************************************************************/
static tBool faultDetection()
{
    tBool faultDetectiontEvent;

    faultDetectiontEvent = false;
    //-----------------------------
    // Actual Faults
    //-----------------------------
//    // TRIP:   Phase A over-current detected
//	tempfaults.motor.B.OverPhaseACurrent = (drvFOC.iAbcFbck.f16Arg1 > MLIB_Mul_F16(I_PH_OVER,FRAC16(0.9))) ? true : false;
//
//	// TRIP:   Phase B over-current detected
//	tempfaults.motor.B.OverPhaseBCurrent = (drvFOC.iAbcFbck.f16Arg2 > MLIB_Mul_F16(I_PH_OVER,FRAC16(0.9))) ? true : false;
//
//	// TRIP:   Phase C over-current detected
//	tempfaults.motor.B.OverPhaseCCurrent = (drvFOC.iAbcFbck.f16Arg3 > MLIB_Mul_F16(I_PH_OVER,FRAC16(0.9))) ? true : false;
//
//	// TRIP:   DC-bus over-voltage
//	tempfaults.motor.B.OverDCBusVoltage  = (meas.measured.f16Udcb.raw > U_DCB_TRIP) ? true : false;
//
//	// TRIP:   DC-bus under-voltage
//	tempfaults.motor.B.UnderDCBusVoltage = (meas.measured.f16Udcb.raw < MLIB_Div_F16(U_DCB_UNDERVOLTAGE,FRAC16(0.91))) ? true : false;
//	
//	// Fault:   Over temperature
//	tempfaults.motor.B.OverHeating   	   = (meas.measured.f16Temp.filt > MLIB_Mul_F16(TEMP_OVER,FRAC16(0.9))) ? true : false;

	//-----------------------------
	// Pending Faults
	//-----------------------------

	if (cntrState.state != fault)
	{
//		// Fault:   Phase A over-current detected
//		permFaults.motor.B.OverPhaseACurrent   = (drvFOC.iAbcFbck.f16Arg1 > I_PH_OVER) ? true : permFaults.motor.B.OverPhaseACurrent;
//
//		// Fault:   Phase B over-current detected
//		permFaults.motor.B.OverPhaseBCurrent   = (drvFOC.iAbcFbck.f16Arg2 > I_PH_OVER) ? true : permFaults.motor.B.OverPhaseBCurrent;
//
//		// Fault:   Phase C over-current detected
//		permFaults.motor.B.OverPhaseCCurrent   = (drvFOC.iAbcFbck.f16Arg3 > I_PH_OVER) ? true : permFaults.motor.B.OverPhaseCCurrent;

//		// Fault:   DC-bus over-voltage
//		permFaults.motor.B.OverDCBusVoltage    = (meas.measured.f16Udcb.raw > U_DCB_OVERVOLTAGE) ? true : permFaults.motor.B.OverDCBusVoltage;
//
//		// Fault:   DC-bus under-voltage
//		if((cntrState.state > init)&&(cntrState.state < reset))
//			permFaults.motor.B.UnderDCBusVoltage   = (meas.measured.f16Udcb.filt < U_DCB_UNDERVOLTAGE) ? true : permFaults.motor.B.UnderDCBusVoltage;
//		else
//			permFaults.motor.B.UnderDCBusVoltage   = false;			

