ikongst/project002/NXP_Integration/FireArrowDrive/MC9S12ZVML128_PMSM.c
		// Fault:   Over temperature
		permFaults.motor.B.OverHeating  = (meas.measured.f16Temp.filt > TEMP_OVER) ? true : permFaults.motor.B.OverHeating;
		
		// Fault:	Sensorless error - estimated speed is of opposite polarity than required speed - e.g. estimation is not aligned with the real speed after Match speed 2
		if(MLIB_Abs_F16(drvFOC.pospeControl.wRotElReqRamp) > drvFOC.pospeSensorless.wRotElMatch_2)
		{
			if(MLIB_Mul_F16(drvFOC.pospeControl.wRotEl, drvFOC.pospeControl.wRotElReqRamp) < 0)
				permFaults.stateMachine.B.FOCError		= true;
		}
		
		permFaults.mcu.B.GDU_Error = GetDriverError();
		permFaults.mcu.B.PWM_Error = GetPMF_Faults();
		permFaults.mcu.B.PTU_Error = GetPTU_Errors();
	}


    if ((permFaults.motor.R != 0x0))
    	faultDetectiontEvent = true;
    if ((permFaults.mcu.R != 0x0))
        faultDetectiontEvent = true;
    if ((permFaults.stateMachine.R != 0x0))
        faultDetectiontEvent = true;

    return faultDetectiontEvent;
}

/* LED application control*/
/***************************************************************************//*!
*
* @brief   LED OFF state
*
* @param   
*
* @return  none
*
******************************************************************************/
void stateLedOFF()
{
	PTS_PTS4 = 0;
	return;
}

/***************************************************************************//*!
*
* @brief   LED ON state
*
* @param   
* 
* @return  none
*
******************************************************************************/
void stateLedON()
{
	PTS_PTS4 = 1;
	return;
}

/***************************************************************************//*!
*
* @brief   LED FLASHING state
*
* @param    
* 
* @return  none
*
******************************************************************************/
void stateLedFLASHING_SLOW()
{
	if((cntrState.usrControl.ledCounter++)>((cntrState.usrControl.ledFlashing)<<1))
	{
		PTS_PTS4 ^= 1;
		cntrState.usrControl.ledCounter = 0;
	}
	return;
}

/***************************************************************************//*!
*
* @brief   LED FLASHING state
*
* @param    
* 
* @return  none
*
******************************************************************************/
void stateLedFLASHING_FASTER()
{
	if((cntrState.usrControl.ledCounter++)>((cntrState.usrControl.ledFlashing>>1)<<1))
	{
		PTS_PTS4 ^= 1;
		cntrState.usrControl.ledCounter = 0;
	}
	return;
}

/***************************************************************************//*!
*
* @brief   LED FLASHING state
*
* @param    
*
* @return  none
*
******************************************************************************/
void stateLedFLASHING_FAST()
{
	if((cntrState.usrControl.ledCounter++)>((cntrState.usrControl.ledFlashing)>>1))
	{
		PTS_PTS4 ^= 1;
		cntrState.usrControl.ledCounter = 0;
	}
	return;	
}



